Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetOptions Method (List<KeyValuePair<String, String>>, Boolean)
 Gets the value options of a string property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetOptions(
	ref List<KeyValuePair<string, string>> StringOptions,
	bool translatedLabels
)
Public Function GetOptions (
	ByRef StringOptions As List(Of KeyValuePair(Of String, String)),
	translatedLabels As Boolean
) As Boolean
Parameters
StringOptions
Type: System.Collections.Generic.List<KeyValuePair<String, String>>
The value options.
translatedLabels
Type: System.Boolean
if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
GetOptions Overload
Tekla.Structures.Catalogs Namespace